cask_args appdir: '/Applications'
tap 'homebrew/cask'

# ==== APPROVED ====
brew 'neovim'
brew 'pure'
cask 'alacritty'
cask 'raycast' # awesome spotlight replacement
cask 'dozer'
cask 'iterm2'
cask 'licecap' # gifs
cask 'postman' # restricted
cask 'slack'
cask 'google-chrome'
cask 'firefox'
cask 'spotify'
cask 'visual-studio-code'
brew 'fzf' # vim dep
brew 'ripgrep' # vim dep

# ==== *NOT* APPROVED ====
# brew 'autojump' # directory changer
# brew 'direnv' # ENV vars by directory
brew 'htop' # should be fine
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'geckodriver' # firefox webdriver fo selenium

# ==== Personal ====
# cask 'discord'

# brew 'mas'
# Mac apple store
# mas 'amphetamine'

# coding
# cask "anaconda"
# cask "expo-xde" # react-native dev made easy

# devicons
tap 'homebrew/cask-fonts'
cask 'font-go-mono-nerd-font'
